CSI API ETABS v1
cTendonObj.GetTendonGeometry Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTendonGeometry(
	string Name,
	ref int NumberPoints,
	ref double[] X,
	ref double[] Y,
	ref double[] Z,
	string CSys = "Global"
)
Function GetTendonGeometry (
	Name As String,
	ByRef NumberPoints As Integer,
	ByRef X As Double(),
	ByRef Y As Double(),
	ByRef Z As Double(),
	Optional CSys As String = "Global"
) As Integer
Dim instance As cTendonObj
Dim Name As String
Dim NumberPoints As Integer
Dim X As Double()
Dim Y As Double()
Dim Z As Double()
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.GetTendonGeometry(Name,
	NumberPoints, X, Y, Z, CSys)
int GetTendonGeometry(
	String^ Name,
	int% NumberPoints,
	array<double>^% X,
	array<double>^% Y,
	array<double>^% Z,
	String^ CSys = L"Global"
)
abstract GetTendonGeometry :
        Name : string *
        NumberPoints : int byref *
        X : float[] byref *
        Y : float[] byref *
        Z : float[] byref *
        ?CSys : string
(* Defaults:
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
Name
Type: System.String
NumberPoints
Type: System.Int32
X
Type: System.Double[]
Y
Type: System.Double[]
Z
Type: System.Double[]
CSys (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cTendonObj Interface
ETABSv1 Namespace